SDC/artillery/getReviews.yml
config:
  target: "http://54.89.208.144:3000"
  phases:
    - duration: 60
      arrivalRate: 1
    - duration: 120
      arrivalRate: 1
      rampTo: 5
    - duration: 60
      arrivalRate: 5
    - duration: 120
      arrivalRate: 5
      rampTo: 10
    - duration: 60
      arrivalRate: 10
    - duration: 120
      arrivalRate: 10
      rampTo: 1
scenarios:
  - flow:
    - loop:
      - get:
          url: "/getReviews/{{$randomNumber(1, 10000)}}"
      count: 100